from pathlib import Path
from datetime import date

BELL_TIMES = {
    1: ("8.00-9.30"),
    2: ("9.40-11.10"),
    3: ("11.20-12.50"),
    4: ("13.30-15.00"),
    5: ("15.10-16.40"),
    6: ("16.50-18.20"),
    7: ("18.30-20.00"),
    8: ("20.10-21.40"),
}

WEEK = ["Понедельник", "Вторник", "Среда", "Четверг", "Пятница", "Суббота"]
MONTH = {
    1: "января", 2: "февраля", 3: "марта", 4: "апреля",
    5: "мая", 6: "июня", 7: "июля", 8: "августа",
    9: "сентября", 10: "октября", 11: "ноября", 12: "декабря",
}

BASE_DIR = Path(__file__).resolve().parent
DB_PATH = BASE_DIR / "database" / "database.db"
BASE_URL = "http://db.biysk.secna.ru/schedule/schedule.test_r.timetable_teacher?name_group_dl={{group}}&cury=2026&cursem=1&ned_dl="
GROUP_URL_MAP = {"аИИП-61": "%D0%B8%B8%BF-61", "аММ-61": "%D0%BC%BC-61", "БТ-61": "%B1%C2-61", "ИСТ-61": "%B8%C1%C2-61", "ИСТ-62": "%B8%C1%C2-62", "КТМ-61": "%BA%C2%BC-61", "мБТ-61": "%DC%B1%C2-61", "ПС-61": "%BF%C1-61", "С-61": "%C1-61",
                 "БТ-51": "%B1%C2-51", "ИСТ-51": "%B8%C1%C2-51", "КТМ-51": "%BA%C2%BC-51", "мБТ-51": "%DC%B1%C2-51", "мИСТ-51": "%DC%B8%C1%C2-51", "ПС-51": "%BF%C1-51", "С-51": "%C1-51"}
ROOMS = {
    "01Б", "02Б",
    "101Б", "103Б", "105А", "110Б", "111Б", "117Б", "117/2Б", "119-I-Б",
    "201Б", "216А", "217А", "218А", "219А", "224А", "227А", "222Б",
    "301Б", "303/3Б", "306Б", "307Б", "308Б", "310Б", "312Б",
    "313Б", "315Б", "316-I-Б", "317Б", "324Б", "313(315)Б", "303/1Б", "322Б",
    "325А", "326А", "326Б", "328А", "331А", "334А",
    "401Б", "402Б", "403-I-Б", "403Б", "406Б", "410Б", "411Б",
    "412Б", "413Б", "416Б", "417Б", "418Б", "420Б",
    "436А", "437А", "440А", "442А", "444А", "446А", "447А", "450А", "451А",
    "Спортзал",
}

SEMESTR_START = date(2026, 8, 31)