from pathlib import Path
from json import loads
from datetime import date

BELL_TIMES = {
    1: ("8.00-9.30"),
    2: ("9.40-11.10"),
    3: ("11.20-12.50"),
    4: ("13.30-15.00"),
    5: ("15.10-16.40"),
    6: ("16.50-18.20"),
    7: ("18.30-20.00"),
    8: ("20.10-21.40"),
}

WEEK = ["Понедельник", "Вторник", "Среда", "Четверг", "Пятница", "Суббота"]
MONTH = {
    1: "января", 2: "февраля", 3: "марта", 4: "апреля",
    5: "мая", 6: "июня", 7: "июля", 8: "августа",
    9: "сентября", 10: "октября", 11: "ноября", 12: "декабря",
}

BASE_DIR = Path(__file__).resolve().parent
DB_PATH = BASE_DIR / "database" / "database.db"
BASE_URL = "http://db.biysk.secna.ru/schedule/schedule.test_r.timetable_teacher?"

with open(BASE_DIR/"groups.json", encoding="UTF-8") as file:
    GROUP_LIST = loads(file.read().strip())

ROOMS = {
    "01Б", "02Б",
    "101Б", "103Б", "105А", "110Б", "111Б", "117Б", "117/2Б", "119-I-Б",
    "201Б", "216А", "217А", "218А", "219А", "224А", "227А", "222Б",
    "301Б", "303/3Б", "306Б", "307Б", "308Б", "310Б", "312Б", "314-I-Б", 
    "313Б", "315Б", "316-I-Б", "317Б", "324Б", "313(315)Б", "303/1Б", "322Б",
    "325А", "326А", "326Б", "328А", "331А", "334А",
    "401Б", "402Б", "403-I-Б", "403Б", "406Б", "410Б", "411Б",
    "412Б", "413Б", "416Б", "417Б", "418Б", "420Б",
    "436А", "437А", "440А", "442А", "444А", "446А", "447А", "450А", "451А",
    "Спортзал", "317/1Б", "319/1Б", "322/1Б", "404/1Б", "416/1Б", "407/1Б", "104Б", "105Б", "Горная","335А", "411Б,416Б,417Б", "409Б,411Б"
}

SEMESTR_START = date(2026, 8, 31)
MATERIALS = {"Вышмат. Клетеник": "https://lib.ysu.am/disciplines_bk/d108c870d37d60bb70389462b4bfc171.pdf",
             "ОРГ. Методичка": "https://disk.yandex.ru/i/bUOZcjt7SKwrcw",
             "История России. Методичка": "https://disk.yandex.ru/i/f0V2dCNn8rh97g",
             "История России. Учебник": "https://фумо05.рф/edumat/CH/CH01/Petrov_History_Russia.pdf?ysclid=muzpp71i7e495997627",
             "Английский. Учебник Андрианова": "https://disk.yandex.ru/i/JzlBx9Guvvv7mA"}
